; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v8 - type_1 ?v7 - type_2)
 	      (pred_3 ?v5 - object ?v7 - type_2)
	      (pred_4 ?v8 - type_1 ?v3 - type_3)
	      (pred_2 ?v8 - type_1 ?v5 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v8 - type_1 ?v4 ?v6 - type_2)
       :precondition (and  (pred_1 ?v8 ?v4))
       :effect (and  (pred_1 ?v8 ?v6)
		     (not (pred_1 ?v8 ?v4))))

   (:action op_1
       :parameters (?v8 - type_1 ?v1 - object ?v2 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v2) (pred_1 ?v8 ?v2) (pred_4 ?v8 ?v3))
       :effect (and (pred_2 ?v8 ?v1 ?v3)
		    (not (pred_3 ?v1 ?v2)) 
		    (not (pred_4 ?v8 ?v3))))

   (:action op_2
       :parameters (?v8 - type_1 ?v1 - object ?v2 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v1 ?v3) (pred_1 ?v8 ?v2))
       :effect (and (pred_3 ?v1 ?v2)
		    (pred_4 ?v8 ?v3)
		    (not (pred_2 ?v8 ?v1 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_10 obj_14 - type_1
obj_07 obj_04 obj_12 obj_01 - type_3
obj_05 obj_11 obj_03 obj_06 - type_2
obj_02 obj_13 obj_08 obj_09 - object)
(:init
(pred_1 obj_10 obj_11)
(pred_4 obj_10 obj_07)
(pred_4 obj_10 obj_04)
(pred_1 obj_14 obj_03)
(pred_4 obj_14 obj_12)
(pred_4 obj_14 obj_01)
(pred_3 obj_02 obj_05)
(pred_3 obj_13 obj_03)
(pred_3 obj_08 obj_05)
(pred_3 obj_09 obj_06)
)
(:goal
(and
(pred_3 obj_02 obj_05)
(pred_3 obj_13 obj_11)
(pred_3 obj_08 obj_03)
(pred_3 obj_09 obj_03)
)
)

(:constraints
  (always (not (pred_1 obj_10 obj_03)))
)
)

; plan
1. (op_3 obj_10 obj_11 obj_05)
   deleted: (pred_1 obj_10 obj_11)
   added: (pred_1 obj_10 obj_05)
   goals met: 1 of 4
2. (op_1 obj_14 obj_13 obj_03 obj_01)
   deleted: (pred_3 obj_13 obj_03) (pred_4 obj_14 obj_01)
   added: (pred_2 obj_14 obj_13 obj_01)
   goals met: 1 of 4
3. (op_3 obj_14 obj_03 obj_11)
   deleted: (pred_1 obj_14 obj_03)
   added: (pred_1 obj_14 obj_11)
   goals met: 1 of 4
4. (op_1 obj_10 obj_08 obj_05 obj_04)
   deleted: (pred_3 obj_08 obj_05) (pred_4 obj_10 obj_04)
   added: (pred_2 obj_10 obj_08 obj_04)
   goals met: 1 of 4
5. (op_3 obj_10 obj_05 obj_06)
   deleted: (pred_1 obj_10 obj_05)
   added: (pred_1 obj_10 obj_06)
   goals met: 1 of 4
6. (op_2 obj_14 obj_13 obj_11 obj_01)
   deleted: (pred_2 obj_14 obj_13 obj_01)
   added: (pred_3 obj_13 obj_11) (pred_4 obj_14 obj_01)
   goals met: 2 of 4
7. (op_3 obj_14 obj_11 obj_06)
   deleted: (pred_1 obj_14 obj_11)
   added: (pred_1 obj_14 obj_06)
   goals met: 2 of 4
8. (op_2 obj_10 obj_08 obj_06 obj_04)
   deleted: (pred_2 obj_10 obj_08 obj_04)
   added: (pred_3 obj_08 obj_06) (pred_4 obj_10 obj_04)
   goals met: 2 of 4
9. (op_1 obj_14 obj_09 obj_06 obj_01)
   deleted: (pred_3 obj_09 obj_06) (pred_4 obj_14 obj_01)
   added: (pred_2 obj_14 obj_09 obj_01)
   goals met: 2 of 4
10. (op_3 obj_14 obj_06 obj_03)
   deleted: (pred_1 obj_14 obj_06)
   added: (pred_1 obj_14 obj_03)
   goals met: 2 of 4
11. (op_2 obj_14 obj_09 obj_03 obj_01)
   deleted: (pred_2 obj_14 obj_09 obj_01)
   added: (pred_3 obj_09 obj_03) (pred_4 obj_14 obj_01)
   goals met: 3 of 4
12. (op_3 obj_14 obj_03 obj_06)
   deleted: (pred_1 obj_14 obj_03)
   added: (pred_1 obj_14 obj_06)
   goals met: 3 of 4
13. (op_1 obj_14 obj_08 obj_06 obj_01)
   deleted: (pred_3 obj_08 obj_06) (pred_4 obj_14 obj_01)
   added: (pred_2 obj_14 obj_08 obj_01)
   goals met: 3 of 4
14. (op_3 obj_14 obj_06 obj_03)
   deleted: (pred_1 obj_14 obj_06)
   added: (pred_1 obj_14 obj_03)
   goals met: 3 of 4
15. (op_2 obj_14 obj_08 obj_03 obj_01)
   deleted: (pred_2 obj_14 obj_08 obj_01)
   added: (pred_3 obj_08 obj_03) (pred_4 obj_14 obj_01)
   goals met: 4 of 4
